In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        'Name': ['John Smith', 'Jane Doe', 'Mary Hampton'],
        'Gender': ['M', 'F', 'F'],
        'Salary': np.array([70000, 55000, 87000])
     },
    index=[1, 2, 3],
)
df

           Name Gender  Salary
1    John Smith      M   70000
2      Jane Doe      F   55000
3  Mary Hampton      F   87000

In [3]:
df['Salary'] = df['Salary'].astype(np.float32)
df

           Name Gender   Salary
1    John Smith      M  70000.0
2      Jane Doe      F  55000.0
3  Mary Hampton      F  87000.0

In [4]:
# Another way to make a df is using pd.Dataframe.from_dict(dict)
# The difference is that from_dict has another argument "orient".
# orient='columns' -> normal df       orient='index' -> indices as features

data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df1 = pd.DataFrame.from_dict(data)
df2 = pd.DataFrame.from_dict(data, orient='index')

In [5]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [6]:
df2

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [7]:
# axis=0 means columns, axis=1 means rows.

df = pd.DataFrame([[1, 2, 3, 4, 5],
                   [10, 20, 30, 40, 50],
                   [100, 200, 300, 400, 500]],
                  columns=['A', 'B', 'C', 'D', 'E'],
                  index=['X', 'Y', 'Z']
)
df

     A    B    C    D    E
X    1    2    3    4    5
Y   10   20   30   40   50
Z  100  200  300  400  500

In [8]:
series1 = pd.Series([5, 10, 20], index=['X', 'Y', 'Z'])
df.add(series1, axis=0)

     A    B    C    D    E
X    6    7    8    9   10
Y   20   30   40   50   60
Z  120  220  320  420  520

In [9]:
series2 = pd.Series([5, 10, 15, 20, 25], index=['A', 'B', 'C', 'D', 'E'])
df.add(series2, axis=1)

     A    B    C    D    E
X    6   12   18   24   30
Y   15   30   45   60   75
Z  105  210  315  420  525

In [10]:
# To get access to display options, use pd.set_option() or pd.options.display.
pd.set_option('display.min_rows', 5)
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns', 50)
pd.reset_option('display.min_rows')

pd.options.display.min_rows = 5
pd.options.display.max_rows = 50
pd.options.display.max_columns = 50

pd.reset_option('display.min_rows')
pd.reset_option('display.max_rows')
pd.reset_option('display.max_columns')

In [11]:
df = pd.DataFrame({
    'Name': ['Alice Smith', 'Bob Johnson', 'Charlie Lee', 'David Brown', 'Eva White', 'Frank Black', 'Grace Green'],
    'Age': [28, 34, 29, 42, 23, 36, 30],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio'],
    'Salary': [70000, 80000, 65000, 120000, 50000, 90000, 75000]
    },
    index=['A', 'B', 'C', 'D', 'E', 'F', 'G'])
df

          Name  Age          City  Salary
A  Alice Smith   28      New York   70000
B  Bob Johnson   34   Los Angeles   80000
C  Charlie Lee   29       Chicago   65000
D  David Brown   42       Houston  120000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
G  Grace Green   30   San Antonio   75000

In [12]:
df.loc['E']

Name      Eva White
Age              23
City        Phoenix
Salary        50000
Name: E, dtype: object

In [13]:
df.iloc[4]

Name      Eva White
Age              23
City        Phoenix
Salary        50000
Name: E, dtype: object

In [14]:
df.loc[['A', 'E']]

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000
E    Eva White   23   Phoenix   50000

In [15]:
df[['Name', 'Salary']]

          Name  Salary
A  Alice Smith   70000
B  Bob Johnson   80000
C  Charlie Lee   65000
D  David Brown  120000
E    Eva White   50000
F  Frank Black   90000
G  Grace Green   75000

In [16]:
df['Salary'].loc['D']

np.int64(120000)

In [17]:
df[df['Salary'] == df['Salary'].max()]['Name']

D    David Brown
Name: Name, dtype: object

In [18]:
# df.at['row', 'column']
df.at['D', 'Age']

np.int64(42)

In [19]:
df.iat[5, 2]

'Philadelphia'

In [20]:
sample_df = df.sample(n=3)
sample_df

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000
E    Eva White   23   Phoenix   50000
D  David Brown   42   Houston  120000

In [21]:
sample_df = df.sample(n=4, replace=True)
sample_df

          Name  Age         City  Salary
E    Eva White   23      Phoenix   50000
E    Eva White   23      Phoenix   50000
G  Grace Green   30  San Antonio   75000
B  Bob Johnson   34  Los Angeles   80000

In [22]:
df['Age'] < 30

A     True
B    False
C     True
D    False
E     True
F    False
G    False
Name: Age, dtype: bool

In [23]:
df[(df['Age'] < 30) & (df['Salary'] >= 70000)]

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000

In [24]:
mask = df['City'] == 'New York'
df.loc[mask]

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000

In [25]:
df.isin(['David Brown', 34])

    Name    Age   City  Salary
A  False  False  False   False
B  False   True  False   False
C  False  False  False   False
D   True  False  False   False
E  False  False  False   False
F  False  False  False   False
G  False  False  False   False

In [26]:
df[df.isin(['David Brown', 34]).any(axis=1)]

          Name  Age         City  Salary
B  Bob Johnson   34  Los Angeles   80000
D  David Brown   42      Houston  120000

In [27]:
df.where(df['Age'] < 30)

          Name   Age      City   Salary
A  Alice Smith  28.0  New York  70000.0
B          NaN   NaN       NaN      NaN
C  Charlie Lee  29.0   Chicago  65000.0
D          NaN   NaN       NaN      NaN
E    Eva White  23.0   Phoenix  50000.0
F          NaN   NaN       NaN      NaN
G          NaN   NaN       NaN      NaN

In [28]:
df[df.where(df['Age'] < 30).any(axis=1)]

          Name  Age      City  Salary
A  Alice Smith   28  New York   70000
C  Charlie Lee   29   Chicago   65000
E    Eva White   23   Phoenix   50000

In [29]:
df

          Name  Age          City  Salary
A  Alice Smith   28      New York   70000
B  Bob Johnson   34   Los Angeles   80000
C  Charlie Lee   29       Chicago   65000
D  David Brown   42       Houston  120000
E    Eva White   23       Phoenix   50000
F  Frank Black   36  Philadelphia   90000
G  Grace Green   30   San Antonio   75000

In [32]:
def salary_status_detector(salary):
    if int(salary) >= 80000:
        return 'High'
    elif int(salary) < 65000:
        return 'Low'
    else:
        return 'Medium'

df['Salary Status'] = df['Salary'].apply(salary_status_detector)

df

          Name  Age          City  Salary Salary Status
A  Alice Smith   28      New York   70000        Medium
B  Bob Johnson   34   Los Angeles   80000          High
C  Charlie Lee   29       Chicago   65000        Medium
D  David Brown   42       Houston  120000          High
E    Eva White   23       Phoenix   50000           Low
F  Frank Black   36  Philadelphia   90000          High
G  Grace Green   30   San Antonio   75000        Medium

In [73]:
mapping = {
    'New York': 'New York', 'Los Angeles': 'California',
        'Chicago': 'Illinois', 'Houston': 'Texas',
           'Phoenix': 'Arizona', 'Philadelphia': 'Pennsylvania',
           'San Antonio': 'Texas'
}
df['State'] = df['City'].map(mapping)

df

          Name  Age          City         State  Salary Salary Status
A  Alice Smith   28      New York      New York   70000        Medium
B  Bob Johnson   34   Los Angeles    California   80000          High
C  Charlie Lee   29       Chicago      Illinois   65000        Medium
D  David Brown   42       Houston         Texas  120000          High
E    Eva White   23       Phoenix       Arizona   50000           Low
F  Frank Black   36  Philadelphia  Pennsylvania   90000          High
G  Grace Green   30   San Antonio         Texas   75000        Medium

In [74]:
# To change feature's orders:
df = df[['Name', 'Age', 'City', 'State', 'Salary', 'Salary Status']]
df

          Name  Age          City         State  Salary Salary Status
A  Alice Smith   28      New York      New York   70000        Medium
B  Bob Johnson   34   Los Angeles    California   80000          High
C  Charlie Lee   29       Chicago      Illinois   65000        Medium
D  David Brown   42       Houston         Texas  120000          High
E    Eva White   23       Phoenix       Arizona   50000           Low
F  Frank Black   36  Philadelphia  Pennsylvania   90000          High
G  Grace Green   30   San Antonio         Texas   75000        Medium

In [75]:
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [76]:
s.map('I am a {}'.format)

0       I am a cat
1       I am a dog
2       I am a nan
3    I am a rabbit
dtype: object

In [77]:
s.map('I am a {}'.format, na_action='ignore')

0       I am a cat
1       I am a dog
2              NaN
3    I am a rabbit
dtype: object

In [78]:
# To call multiple functions on rows or columns in a df, use .agg([functions]):
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [79]:
df1.agg(['sum', 'mean', 'max', 'min'])

         A      B       C
sum   15.0  150.0  1500.0
mean   3.0   30.0   300.0
max    5.0   50.0   500.0
min    1.0   10.0   100.0

In [80]:
df1.agg(['sum', 'mean', 'max', 'min'], axis=1)

     sum   mean    max  min
0  111.0   37.0  100.0  1.0
1  222.0   74.0  200.0  2.0
2  333.0  111.0  300.0  3.0
3  444.0  148.0  400.0  4.0
4  555.0  185.0  500.0  5.0

In [81]:
df

          Name  Age          City         State  Salary Salary Status
A  Alice Smith   28      New York      New York   70000        Medium
B  Bob Johnson   34   Los Angeles    California   80000          High
C  Charlie Lee   29       Chicago      Illinois   65000        Medium
D  David Brown   42       Houston         Texas  120000          High
E    Eva White   23       Phoenix       Arizona   50000           Low
F  Frank Black   36  Philadelphia  Pennsylvania   90000          High
G  Grace Green   30   San Antonio         Texas   75000        Medium

In [82]:
df_salary_status = df['Salary'].agg(['mean', 'max', 'min']).round(2)
print(f'Salary Status:\n{df_salary_status}')

Salary Status:
mean     78571.43
max     120000.00
min      50000.00
Name: Salary, dtype: float64

In [83]:
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [84]:
# Apply different functions to different columns
df1.agg({
    'A': ['sum', 'mean'],
    'B': ['min', 'max'],
    'C': 'std'
})

         A     B           C
sum   15.0   NaN         NaN
mean   3.0   NaN         NaN
min    NaN  10.0         NaN
max    NaN  50.0         NaN
std    NaN   NaN  158.113883

Use `df.loc[:, something]` when you want to:
- 1. Select a subset of columns and possibly assign new columns later.
- 2. Select rows by label and columns at the same time.
- 3. Assign a new column safely after slicing or reordering (IMP).

This helps you avoid facing `SettingWithCopyWarning` warning (avoids `SettingWithCopyWarning` without creating a full copy).

In [3]:
# df.valuecount() returns a Series. To find a specific data's count, just use [index]:
s = pd.Series(['A', 'A', 'A', 'B', 'C', 'D'])
s.value_counts()

A    3
B    1
C    1
D    1
Name: count, dtype: int64

In [4]:
s.value_counts()['A']

np.int64(3)

The best way to reorder a df's columns, is using `df.loc[:, [new order]]`.

Alse, to avoid mistakes, use `df.columns.tolist()` to get the list of columns.

In [ ]:
email_df = pd.read_csv('/home/mseifoori/Machine-Learning-Exercises/data/people-10000.csv')
email_df['First Name'] = email_df['First Name'].astype('str')
email_df['Last Name'] = email_df['Last Name'].astype('str')
email_df['Full Name'] = email_df['First Name'].str.cat(email_df['Last Name'], sep= ' ')

In [8]:
email_df.columns.tolist()

['Index',
 'User Id',
 'First Name',
 'Last Name',
 'Sex',
 'Email',
 'Phone',
 'Date of birth',
 'Job Title',
 'Full Name']

In [9]:
email_df = email_df.loc[:, ['Index', 'User Id', 'First Name', 'Last Name', 'Full Name', 'Sex', 'Email', 'Phone', 'Date of birth', 'Job Title']]

In [10]:
email_df

,Index,User Id,First Name,Last Name,Full Name,Sex,Email,Phone,Date of birth,Job Title
0,1,5f10e9D33fC5f2b,Sara,Mcguire,Sara Mcguire,Female,tsharp@example.net,(971)643-6089x9160,1921-08-17,"Editor, commissioning"
1,2,751cD1cbF77e005,Alisha,Hebert,Alisha Hebert,Male,vincentgarrett@example.net,+1-114-355-1841x78347,1969-06-28,Broadcast engineer
2,3,DcEFDB2D2e62bF9,Gwendolyn,Sheppard,Gwendolyn Sheppard,Male,mercadojonathan@example.com,9017807728,1915-09-25,Industrial buyer
3,4,C88661E02EEDA9e,Kristine,Mccann,Kristine Mccann,Female,lindsay55@example.com,+1-607-333-9911x59088,1978-07-27,Multimedia specialist
4,5,fafF1aBDebaB2a6,Bobby,Pittman,Bobby Pittman,Female,blevinsmorgan@example.com,3739847538,1989-11-17,Planning and development surveyor
...,...,...,...,...,...,...,...,...,...,...
9995,9996,D66F0e4EdFc35e6,Tina,Sherman,Tina Sherman,Male,bartlettcolleen@example.org,(455)476-4044x5755,1974-07-28,"Scientist, physiological"
9996,9997,c753d8B9F5b6054,Earl,Jennings,Earl Jennings,Female,andreabenton@example.com,009.056.6505,1932-08-20,Warehouse manager
9997,9998,Fb2c7daAdD82dAE,Ellen,Dominguez,Ellen Dominguez,Female,michaelayoder@example.net,409-428-4297x469,1966-06-06,Lawyer
9998,9999,34D88Ffc743Ca5B,Emma,Clark,Emma Clark,Male,pstrickland@example.com,849-868-8653,1907-05-09,Accounting technician
9999,10000,82D540ce0BE556f,Katrina,Schwartz,Katrina Schwartz,Female,andres56@example.org,001-874-330-5546x16770,1935-08-14,Drilling engineer

In [11]:
email_df['Phone'] = email_df['Phone'].astype('str')
us_numbers_plus1 = email_df['Phone'].str.startswith('+1').value_counts()[True]

print(f'Count of +1 US phone numbers in this dataset:\n{us_numbers_plus1}')

Count of +1 US phone numbers in this dataset:
1595

In [3]:
ts = pd.Timestamp('2024-12-04, 13:26')
ts

Timestamp('2024-12-04 13:26:00')

In [4]:
ts.minute

26

In [6]:
ts = pd.Timestamp('2025-04-22, 18:32', tz='UTC')
ts

Timestamp('2025-04-22 18:32:00+0000', tz='UTC')

In [7]:
ts.tz_convert('US/Eastern')

Timestamp('2025-04-22 14:32:00-0400', tz='US/Eastern')

In [11]:
test_dates = pd.date_range(start='2025-05-01', periods=5, freq='D')
month_1_tests_df = pd.DataFrame({
    'Patient_ID': [1, 2, 3, 4, 5],
    'Test Date': test_dates,
    'Test Type': ['A', 'B', 'A', 'C', 'B'],
    'Result': ['P', 'High', 'N', 2.3, 'Normal']
}, index=np.arange(1, len(test_dates)+1))

month_1_tests_df

   Patient_ID  Test Date Test Type  Result
1           1 2025-05-01         A       P
2           2 2025-05-02         B    High
3           3 2025-05-03         A       N
4           4 2025-05-04         C     2.3
5           5 2025-05-05         B  Normal

In [ ]:
email_df = pd.read_csv('/home/mseifoori/Machine-Learning-Exercises/data/people-10000.csv')
email_df

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,5f10e9D33fC5f2b,Sara,Mcguire,Female,tsharp@example.net,(971)643-6089x9160,1921-08-17,"Editor, commissioning"
1,2,751cD1cbF77e005,Alisha,Hebert,Male,vincentgarrett@example.net,+1-114-355-1841x78347,1969-06-28,Broadcast engineer
2,3,DcEFDB2D2e62bF9,Gwendolyn,Sheppard,Male,mercadojonathan@example.com,9017807728,1915-09-25,Industrial buyer
3,4,C88661E02EEDA9e,Kristine,Mccann,Female,lindsay55@example.com,+1-607-333-9911x59088,1978-07-27,Multimedia specialist
4,5,fafF1aBDebaB2a6,Bobby,Pittman,Female,blevinsmorgan@example.com,3739847538,1989-11-17,Planning and development surveyor
...,...,...,...,...,...,...,...,...,...
9995,9996,D66F0e4EdFc35e6,Tina,Sherman,Male,bartlettcolleen@example.org,(455)476-4044x5755,1974-07-28,"Scientist, physiological"
9996,9997,c753d8B9F5b6054,Earl,Jennings,Female,andreabenton@example.com,009.056.6505,1932-08-20,Warehouse manager
9997,9998,Fb2c7daAdD82dAE,Ellen,Dominguez,Female,michaelayoder@example.net,409-428-4297x469,1966-06-06,Lawyer
9998,9999,34D88Ffc743Ca5B,Emma,Clark,Male,pstrickland@example.com,849-868-8653,1907-05-09,Accounting technician
9999,10000,82D540ce0BE556f,Katrina,Schwartz,Female,andres56@example.org,001-874-330-5546x16770,1935-08-14,Drilling engineer

In [13]:
email_df['Date of birth'] = email_df['Date of birth'].astype('datetime64[s]')
email_df['Date of birth']

0      1921-08-17
1      1969-06-28
2      1915-09-25
3      1978-07-27
4      1989-11-17
          ...
9995   1974-07-28
9996   1932-08-20
9997   1966-06-06
9998   1907-05-09
9999   1935-08-14
Name: Date of birth, Length: 10000, dtype: datetime64[s]

In [14]:
email_df['Date of birth'] =  email_df['Date of birth'].dt.strftime('%Y/%m/%d')

In [16]:
email_df['Date of birth']

0       1921/08/17
1       1969/06/28
2       1915/09/25
3       1978/07/27
4       1989/11/17
           ...
9995    1974/07/28
9996    1932/08/20
9997    1966/06/06
9998    1907/05/09
9999    1935/08/14
Name: Date of birth, Length: 10000, dtype: object

In [18]:
email_df['Date of birth'] = email_df['Date of birth'].astype('datetime64[s]')
email_df['Date of birth'].dt.tz_localize('UTC')

0      1921-08-17 00:00:00+00:00
1      1969-06-28 00:00:00+00:00
2      1915-09-25 00:00:00+00:00
3      1978-07-27 00:00:00+00:00
4      1989-11-17 00:00:00+00:00
                  ...
9995   1974-07-28 00:00:00+00:00
9996   1932-08-20 00:00:00+00:00
9997   1966-06-06 00:00:00+00:00
9998   1907-05-09 00:00:00+00:00
9999   1935-08-14 00:00:00+00:00
Name: Date of birth, Length: 10000, dtype: datetime64[s, UTC]

In [20]:
# To get french names, for example, you can use locale library:
import locale

locale.setlocale(locale.LC_TIME, '')

'C.UTF-8'

Encoding:
- One Hot Encoding (for nominal categorical data where there's no inherent order among categories)
- Ordinal Encoding (for ordinal categorical data where there's a clear ordering of categories)

In [27]:
df = pd.DataFrame({
    'Clothes': ['Shirt', 'Pants', 'Jacket', 'Shoes', 'Hat'],
    'Price': [20, 30, 50, 80, 15],
    'Size': ['M', 'L', 'XL', 'M', 'S'],
    'Color': ['Red', 'Blue', 'Black', 'White', 'Green']
}, index=[1, 2, 3, 4, 5])

df['Size'] = pd.Categorical(df['Size'], categories=['S', 'M', 'L', 'XL', 'XXL'])
df['Color'] = pd.Categorical(df['Color'], categories=['Red', 'Blue', 'Black', 'White', 'Green', 'Yellow'])
df

  Clothes  Price Size  Color
1   Shirt     20    M    Red
2   Pants     30    L   Blue
3  Jacket     50   XL  Black
4   Shoes     80    M  White
5     Hat     15    S  Green

In [28]:
# One Hot Encoding:
df_one_hot_encoded = pd.get_dummies(df, columns=['Color'])
df_one_hot_encoded

,Clothes,Price,Size,Color_Red,Color_Blue,Color_Black,Color_White,Color_Green,Color_Yellow
1,Shirt,20,M,True,False,False,False,False,False
2,Pants,30,L,False,True,False,False,False,False
3,Jacket,50,XL,False,False,True,False,False,False
4,Shoes,80,M,False,False,False,True,False,False
5,Hat,15,S,False,False,False,False,True,False

In [29]:
df_one_hot_encoded = pd.get_dummies(df, columns=['Color'], prefix=['C'])
df_one_hot_encoded

  Clothes  Price Size  C_Red  C_Blue  C_Black  C_White  C_Green  C_Yellow
1   Shirt     20    M   True   False    False    False    False     False
2   Pants     30    L  False    True    False    False    False     False
3  Jacket     50   XL  False   False     True    False    False     False
4   Shoes     80    M  False   False    False     True    False     False
5     Hat     15    S  False   False    False    False     True     False

In [30]:
# Ordinal Encoding:
df['Size Encoded'] = pd.Categorical(df['Size'],
                                    categories=df['Size'].cat.categories.tolist(),
                                    ordered=True).codes

df

  Clothes  Price Size  Color  Size Encoded
1   Shirt     20    M    Red             1
2   Pants     30    L   Blue             2
3  Jacket     50   XL  Black             3
4   Shoes     80    M  White             1
5     Hat     15    S  Green             0

`.drop_duplicate(subset=['feature 1', 'feature 2], keep='False')`

The `keep` parameter in `.duplicated()` has three options:
- `'first'` (default): Mark duplicates as `True` except for the first occurrence.
- `'last'`: Mark duplicates as `True` except for the last occurrence.
- `False`: Mark all duplicates as `True`.

default -> 'first'

In [2]:
df = pd.DataFrame({
    'Name': ['John', 'Jane', 'John', 'Mike', 'Jane'],
    'Age': [28, 32, 28, 45, 32],
    'City': ['New York', 'Boston', 'New York', 'Chicago', 'Boston']
})

df

   Name  Age      City
0  John   28  New York
1  Jane   32    Boston
2  John   28  New York
3  Mike   45   Chicago
4  Jane   32    Boston

In [3]:
df.duplicated(keep='first')

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [4]:
df.duplicated(keep='last')

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [5]:
df.duplicated(keep=False)

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [6]:
df.duplicated(subset=['Name', 'City'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [8]:
df = df.drop_duplicates(subset=['Name', 'City'], keep='first')
df.index = np.arange(1, len(df)+1)
df

   Name  Age      City
1  John   28  New York
2  Jane   32    Boston
3  Mike   45   Chicago

In [9]:
pd.isna(np.nan) == pd.isna(None)

True

In [10]:
np.nan == None

False

In [12]:
np.nan == np.nan

False

In [2]:
# Be aware that when you make a df by concatenating dfs and using keys=[], .reset_index() is NOT a good way to reset the index.
# Instead, use .index = [] to change the index.
customers_us = pd.DataFrame({
    'customer_id': [1, 2, 3],
    'name': ['John Doe', 'Jane Smith', 'Bob Johnson'],
    'country': ['USA', 'USA', 'USA']
})

customers_uk = pd.DataFrame({
    'customer_id': [4, 5, 6],
    'name': ['Alice Brown', 'Charlie Davis', 'Emma Wilson'],
    'country': ['UK', 'UK', 'UK']
})

In [3]:
pd.concat([customers_us, customers_uk], keys=['US Customers', 'UK Customers'])

                customer_id           name country
US Customers 0            1       John Doe     USA
             1            2     Jane Smith     USA
             2            3    Bob Johnson     USA
UK Customers 0            4    Alice Brown      UK
             1            5  Charlie Davis      UK
             2            6    Emma Wilson      UK

In [4]:
pd.concat([customers_us, customers_uk], keys=['US Customers', 'UK Customers']).reset_index()

        level_0  level_1  customer_id           name country
0  US Customers        0            1       John Doe     USA
1  US Customers        1            2     Jane Smith     USA
2  US Customers        2            3    Bob Johnson     USA
3  UK Customers        0            4    Alice Brown      UK
4  UK Customers        1            5  Charlie Davis      UK
5  UK Customers        2            6    Emma Wilson      UK

In [7]:
sales_info = pd.concat([customers_us, customers_uk], keys=['US Customers', 'UK Customers'])
sales_info.index = [1, 2, 3, 4, 5, 6]
sales_info

   customer_id           name country
1            1       John Doe     USA
2            2     Jane Smith     USA
3            3    Bob Johnson     USA
4            4    Alice Brown      UK
5            5  Charlie Davis      UK
6            6    Emma Wilson      UK

An inner merge returns only the rows where there's a match in both DataFrames.

An outer merge returns all rows from both DataFrames, filling in NaN where there's no match.

A left merge keeps all rows from the left DataFrame, while a right merge keeps all rows from the right DataFrame.

In [8]:
patients_df = pd.DataFrame({
    'Patient_ID': [101, 102, 103, 104, 105],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 28]
})

tests_df = pd.DataFrame({
    'Patient_ID': [102, 103, 104, 106],
    'Test_Type': ['Blood', 'X-Ray', 'MRI', 'CT'],
    'Result': ['Normal', 'Fracture', 'Clear', 'Clear']
})

In [9]:
pd.merge(patients_df, tests_df, on='Patient_ID', how='inner')

   Patient_ID     Name  Age Test_Type    Result
0         102      Bob   30     Blood    Normal
1         103  Charlie   35     X-Ray  Fracture
2         104    David   40       MRI     Clear

In [10]:
pd.merge(patients_df, tests_df, on='Patient_ID', how='outer')

   Patient_ID     Name   Age Test_Type    Result
0         101    Alice  25.0       NaN       NaN
1         102      Bob  30.0     Blood    Normal
2         103  Charlie  35.0     X-Ray  Fracture
3         104    David  40.0       MRI     Clear
4         105      Eva  28.0       NaN       NaN
5         106      NaN   NaN        CT     Clear

In [11]:
pd.merge(patients_df, tests_df, on='Patient_ID', how='left')

   Patient_ID     Name  Age Test_Type    Result
0         101    Alice   25       NaN       NaN
1         102      Bob   30     Blood    Normal
2         103  Charlie   35     X-Ray  Fracture
3         104    David   40       MRI     Clear
4         105      Eva   28       NaN       NaN

In [29]:
# To merge on multiple keys, use merge() multiple times:
customers = pd.DataFrame({
    'customer_id': [1, 2, 3],
    'name': ['John Doe', 'Jane Smith', 'Bob Johnson']
})
products = pd.DataFrame({
    'product_id': ['P1', 'P2', 'P3'],
    'product_name': ['Laptop', 'Smartphone', 'Tablet']
})

purchases = pd.DataFrame({
    'customer_id': [1, 2, 3, 2, 1],
    'product_id': ['P1', 'P2', 'P3', 'P1', 'P3'],
    'quantity': [1, 2, 1, 1, 3]
})

pd.merge(customers, purchases, on='customer_id').merge(products, on='product_id')

   customer_id         name product_id  quantity product_name
0            1     John Doe         P1         1       Laptop
1            1     John Doe         P3         3       Tablet
2            2   Jane Smith         P2         2   Smartphone
3            2   Jane Smith         P1         1       Laptop
4            3  Bob Johnson         P3         1       Tablet

In [12]:
tests_df['Name'] = ['Bob', 'Charlie', 'David', 'Maria']

In [13]:
tests_df

   Patient_ID Test_Type    Result     Name
0         102     Blood    Normal      Bob
1         103     X-Ray  Fracture  Charlie
2         104       MRI     Clear    David
3         106        CT     Clear    Maria

In [14]:
pd.merge(patients_df, tests_df, on='Patient_ID', how='right').drop(columns='Name_y')

   Patient_ID   Name_x   Age Test_Type    Result
0         102      Bob  30.0     Blood    Normal
1         103  Charlie  35.0     X-Ray  Fracture
2         104    David  40.0       MRI     Clear
3         106      NaN   NaN        CT     Clear

In [15]:
pd.merge(patients_df, tests_df, on='Patient_ID', how='right', indicator=True)

   Patient_ID   Name_x   Age Test_Type    Result   Name_y      _merge
0         102      Bob  30.0     Blood    Normal      Bob        both
1         103  Charlie  35.0     X-Ray  Fracture  Charlie        both
2         104    David  40.0       MRI     Clear    David        both
3         106      NaN   NaN        CT     Clear    Maria  right_only

In [16]:
pd.merge(patients_df, tests_df, on='Patient_ID', how='right', suffixes=['_1', '_2'])

   Patient_ID   Name_1   Age Test_Type    Result   Name_2
0         102      Bob  30.0     Blood    Normal      Bob
1         103  Charlie  35.0     X-Ray  Fracture  Charlie
2         104    David  40.0       MRI     Clear    David
3         106      NaN   NaN        CT     Clear    Maria

In [20]:
patients_info = pd.merge(patients_df, tests_df, on='Patient_ID', how='right')
patients_info

   Patient_ID   Name_x   Age Test_Type    Result   Name_y
0         102      Bob  30.0     Blood    Normal      Bob
1         103  Charlie  35.0     X-Ray  Fracture  Charlie
2         104    David  40.0       MRI     Clear    David
3         106      NaN   NaN        CT     Clear    Maria

In [21]:
patients_info.index = patients_info['Patient_ID']
patients_info.drop(columns='Patient_ID', inplace=True)

In [22]:
patients_info

             Name_x   Age Test_Type    Result   Name_y
Patient_ID
102             Bob  30.0     Blood    Normal      Bob
103         Charlie  35.0     X-Ray  Fracture  Charlie
104           David  40.0       MRI     Clear    David
106             NaN   NaN        CT     Clear    Maria

While `merge()` and `join()` can often be used interchangeably, `join()` is specifically designed for index-based joining and is often more convenient when working with DataFrames that have meaningful indexes.

In [23]:
data = {
    'Patient_ID': [102, 104, 106, 107],
    'Doctor': ['Dr. Smith', 'Dr. Lee', 'Dr. Patel', 'Dr. Wong'],
    'Visit_Date': ['2025-08-01', '2025-08-02', '2025-08-03', '2025-08-04']
}
df_data = pd.DataFrame(data).set_index('Patient_ID')
df_data

               Doctor  Visit_Date
Patient_ID
102         Dr. Smith  2025-08-01
104           Dr. Lee  2025-08-02
106         Dr. Patel  2025-08-03
107          Dr. Wong  2025-08-04

In [24]:
pd.merge(patients_info, df_data, left_index=True, right_index=True, how='outer')

             Name_x   Age Test_Type    Result   Name_y     Doctor  Visit_Date
Patient_ID
102             Bob  30.0     Blood    Normal      Bob  Dr. Smith  2025-08-01
103         Charlie  35.0     X-Ray  Fracture  Charlie        NaN         NaN
104           David  40.0       MRI     Clear    David    Dr. Lee  2025-08-02
106             NaN   NaN        CT     Clear    Maria  Dr. Patel  2025-08-03
107             NaN   NaN       NaN       NaN      NaN   Dr. Wong  2025-08-04

In [25]:
patients_info.join(df_data, how='outer')

             Name_x   Age Test_Type    Result   Name_y     Doctor  Visit_Date
Patient_ID
102             Bob  30.0     Blood    Normal      Bob  Dr. Smith  2025-08-01
103         Charlie  35.0     X-Ray  Fracture  Charlie        NaN         NaN
104           David  40.0       MRI     Clear    David    Dr. Lee  2025-08-02
106             NaN   NaN        CT     Clear    Maria  Dr. Patel  2025-08-03
107             NaN   NaN       NaN       NaN      NaN   Dr. Wong  2025-08-04

# Grouping and Aggregating Data

In [2]:
dates = pd.date_range(start='2024-01-01', end='2025-08-31', freq='D')
products = ['Laptop', 'Smartphone', 'Airpods', 'Tablet', 'Headphones']
regions = ['North', 'South', 'East', 'West']

sales_df = pd.DataFrame({
    'Date': np.random.choice(dates, 1000),
    'Region': np.random.choice(regions, 1000),
    'Product': np.random.choice(products, 1000),
    'Number of Sales': np.random.randint(100, 3000, 1000),
    'Units': np.random.randint(1, 10, 1000),
}, index=np.arange(1, 1001))

sales_df['Revenue'] = sales_df['Number of Sales'] * sales_df['Units']

sales_df

           Date Region     Product  Number of Sales  Units  Revenue
1    2025-08-29   East     Airpods              602      3     1806
2    2024-08-28  South      Tablet              265      4     1060
3    2025-05-28   East      Tablet             2633      9    23697
4    2024-12-17   East      Laptop             2743      2     5486
5    2024-09-28   West      Laptop             1887      5     9435
...         ...    ...         ...              ...    ...      ...
996  2024-11-20   East  Headphones              485      3     1455
997  2024-03-06   West     Airpods             2831      6    16986
998  2024-05-12  North      Laptop             2799      7    19593
999  2024-06-07  North      Tablet             1433      9    12897
1000 2024-10-19   West  Headphones             2986      6    17916

[1000 rows x 6 columns]

In [3]:
sales_df.groupby('Product')['Revenue'].sum()

Product
Airpods       1508072
Headphones    1572466
Laptop        1529248
Smartphone    1636972
Tablet        1379059
Name: Revenue, dtype: int64

In [4]:
product_summary = sales_df.groupby('Product').agg({
    'Number of Sales': 'mean',
    'Revenue': 'sum'
})
product_summary

            Number of Sales  Revenue
Product
Airpods         1561.914141  1508072
Headphones      1585.037383  1572466
Laptop          1641.336735  1529248
Smartphone      1602.915888  1636972
Tablet          1512.157303  1379059

In [5]:
sales_df.groupby(['Product', 'Region']).agg({
    'Revenue': 'mean',
    'Number of Sales': 'sum'
})

                       Revenue  Number of Sales
Product    Region
Airpods    East    7223.847826            70521
           North   6530.650000            56031
           South   8198.433962            82810
           West    8136.135593            99897
Headphones East    7324.176471            78534
           North   7617.508197            97024
           South   7141.292683            67898
           West    7237.245902            95742
Laptop     East    8005.370370            86220
           North   7631.409091            68243
           South   8195.692308            90589
           West    7282.608696            76650
Smartphone East    8046.222222            89558
           North   7144.233333            96160
           South   8561.540000            79923
           West    6914.900000            77383
Tablet     East    6939.775000            60234
           North   8246.710526            57814
           South   7767.865385            77655
           West    8003.416667            73461

In [6]:
sales_df.groupby(['Product', 'Region']).agg({
    'Revenue': 'mean',
    'Number of Sales': 'sum'
}).unstack(level='Region')

                Revenue                                         \
Region             East        North        South         West
Product
Airpods     7223.847826  6530.650000  8198.433962  8136.135593
Headphones  7324.176471  7617.508197  7141.292683  7237.245902
Laptop      8005.370370  7631.409091  8195.692308  7282.608696
Smartphone  8046.222222  7144.233333  8561.540000  6914.900000
Tablet      6939.775000  8246.710526  7767.865385  8003.416667

           Number of Sales
Region                East  North  South   West
Product
Airpods              70521  56031  82810  99897
Headphones           78534  97024  67898  95742
Laptop               86220  68243  90589  76650
Smartphone           89558  96160  79923  77383
Tablet               60234  57814  77655  73461

In [7]:
sales_df.groupby(['Product', 'Region']).agg({
    'Revenue': 'mean',
    'Number of Sales': 'sum'
}).unstack(level='Product')

             Revenue                                                      \
Product      Airpods   Headphones       Laptop   Smartphone       Tablet
Region
East     7223.847826  7324.176471  8005.370370  8046.222222  6939.775000
North    6530.650000  7617.508197  7631.409091  7144.233333  8246.710526
South    8198.433962  7141.292683  8195.692308  8561.540000  7767.865385
West     8136.135593  7237.245902  7282.608696  6914.900000  8003.416667

        Number of Sales
Product         Airpods Headphones Laptop Smartphone Tablet
Region
East              70521      78534  86220      89558  60234
North             56031      97024  68243      96160  57814
South             82810      67898  90589      79923  77655
West              99897      95742  76650      77383  73461

In [8]:
def get_month(date):
    return date.strftime('%b')

month_sales_summary = sales_df.groupby([sales_df['Date'].apply(get_month), 'Product'])['Number of Sales'].sum().unstack(level='Date')
month_sales_summary

Date,Apr,Aug,Dec,Feb,Jan,Jul,Jun,Mar,May,Nov,Oct,Sep
Product,,,,,,,,,,,,
Airpods,31530,19853,7833,30714,36753,40055,28798,23473,25359,23468,18007,23416
Headphones,27798,27434,9868,31384,36927,22984,38449,51973,37536,23027,11469,20349
Laptop,31860,35866,31883,32253,30793,35738,20630,22980,27322,20198,15506,16673
Smartphone,33112,41159,2093,53078,28737,32546,29920,45797,19870,15552,19871,21289
Tablet,26745,40446,10455,31178,31810,28022,27813,16914,14384,15885,14176,11336

In [9]:
# To find a record (and the related feature) when you have the data:
month_sales_summary.loc['Airpods'][month_sales_summary.loc['Airpods'] == month_sales_summary.loc['Airpods'].max()]

Date
Jul    40055
Name: Airpods, dtype: int64

In [10]:
def get_summary(df, groupby, column):
    return df.groupby(groupby)[column].agg([
        'count', 'sum', 'mean', 'median', 'min', 'max', 'std'
    ])
    
get_summary(sales_df, 'Product', 'Revenue')

            count      sum         mean  median  min    max          std
Product
Airpods       198  1508072  7616.525253  6717.5  340  24561  6075.349173
Headphones    214  1572466  7347.971963  5820.5  164  26226  6079.630659
Laptop        196  1529248  7802.285714  5809.5  295  26640  6125.849252
Smartphone    214  1636972  7649.401869  5665.0  107  26685  6537.000853
Tablet        178  1379059  7747.522472  5856.5  269  26379  6278.844109

In [11]:
sales_df.groupby('Product').get_group('Laptop')

          Date Region Product  Number of Sales  Units  Revenue
4   2025-08-10  North  Laptop             2124      4     8496
5   2025-08-13  North  Laptop              258      8     2064
7   2024-11-29  North  Laptop              163      6      978
13  2024-06-14  South  Laptop              867      1      867
19  2024-09-05  North  Laptop             1818      6    10908
..         ...    ...     ...              ...    ...      ...
966 2025-01-30  South  Laptop             2997      4    11988
979 2025-01-26   West  Laptop             1748      4     6992
987 2024-02-15  South  Laptop             1344      7     9408
989 2025-07-19   East  Laptop             1485      9    13365
993 2025-05-28  North  Laptop             2265      9    20385

[196 rows x 6 columns]

In [12]:
sales_df.groupby('Product').get_group('Laptop').groupby('Region').get_group('South')

          Date Region Product  Number of Sales  Units  Revenue
13  2024-06-14  South  Laptop              867      1      867
21  2024-07-16  South  Laptop             2717      7    19019
51  2024-06-07  South  Laptop             1942      6    11652
93  2025-01-05  South  Laptop             2035      2     4070
114 2024-10-10  South  Laptop             1912      3     5736
117 2024-10-01  South  Laptop              179      5      895
156 2025-06-15  South  Laptop              923      5     4615
160 2024-05-10  South  Laptop              187      9     1683
162 2025-04-24  South  Laptop              269      8     2152
167 2025-08-30  South  Laptop              468      9     4212
197 2024-09-11  South  Laptop             1555      2     3110
211 2024-04-13  South  Laptop             2730      4    10920
237 2024-11-19  South  Laptop             2456      6    14736
247 2024-12-26  South  Laptop              731      6     4386
256 2024-05-31  South  Laptop              628      3     1884
269 2024-03-28  South  Laptop             2974      3     8922
274 2024-11-27  South  Laptop              784      4     3136
275 2024-10-02  South  Laptop             1413      3     4239
302 2024-06-11  South  Laptop             2821      7    19747
329 2024-12-14  South  Laptop             2983      4    11932
336 2024-01-20  South  Laptop              579      5     2895
341 2025-07-21  South  Laptop              541      7     3787
350 2024-07-18  South  Laptop             2699      1     2699
427 2024-12-29  South  Laptop             2227      5    11135
439 2025-06-25  South  Laptop             2982      6    17892
446 2025-04-22  South  Laptop             1149      7     8043
454 2025-01-04  South  Laptop             1448      7    10136
455 2024-04-15  South  Laptop             2324      1     2324
468 2025-08-19  South  Laptop             1702      3     5106
490 2024-05-18  South  Laptop             2369      4     9476
501 2024-10-07  South  Laptop             1378      9    12402
502 2024-12-01  South  Laptop             2504      1     2504
605 2024-01-15  South  Laptop             2324      2     4648
609 2024-06-26  South  Laptop              893      5     4465
628 2025-04-13  South  Laptop             2893      6    17358
632 2024-04-15  South  Laptop             2483      5    12415
642 2025-05-16  South  Laptop             2279      8    18232
656 2025-07-26  South  Laptop             1064      1     1064
694 2025-02-10  South  Laptop             2449      8    19592
697 2025-01-11  South  Laptop             1182      5     5910
737 2025-06-30  South  Laptop             1295      5     6475
746 2024-02-04  South  Laptop             2632      6    15792
757 2025-02-24  South  Laptop             2454      9    22086
797 2024-05-10  South  Laptop              429      2      858
804 2024-12-21  South  Laptop              626      1      626
805 2024-06-01  South  Laptop              816      5     4080
816 2025-07-24  South  Laptop             1667      7    11669
827 2024-02-19  South  Laptop             2744      2     5488
938 2025-08-06  South  Laptop             2935      5    14675
959 2024-12-29  South  Laptop             2607      5    13035
966 2025-01-30  South  Laptop             2997      4    11988
987 2024-02-15  South  Laptop             1344      7     9408

In [13]:
sales_df.groupby('Product').get_group('Laptop').groupby('Region').get_group('South')['Revenue'].sum()

np.int64(426176)

In [3]:
sales_df.pivot_table(index='Product', values=['Number of Sales', 'Units'], columns='Region')

           Number of Sales                                            Units  \
Region                East        North        South         West      East
Product
Airpods        1614.142857  1582.384615  1746.588235  1633.184211  5.160714
Headphones     1525.410714  1608.000000  1336.837209  1526.642857  4.910714
Laptop         1642.226415  1463.897436  1585.181818  1691.127273  5.207547
Smartphone     1469.688889  1376.142857  1547.175000  1524.716981  5.333333
Tablet         1651.770833  1706.000000  1344.436364  1517.218750  5.812500


Region         North     South      West
Product
Airpods     4.884615  4.568627  4.684211
Headphones  4.373134  4.558140  4.942857
Laptop      4.846154  5.068182  4.690909
Smartphone  4.682540  5.525000  5.490566
Tablet      5.400000  4.709091  4.812500

In [4]:
sales_df.pivot_table(index='Product', values=['Number of Sales', 'Units'], columns='Region', aggfunc=['sum', 'mean']).stack()

/tmp/ipykernel_32508/1097705428.py:1: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  sales_df.pivot_table(index='Product', values=['Number of Sales', 'Units'], columns='Region', aggfunc=['sum', 'mean']).stack()

                              sum                  mean
                  Number of Sales Units Number of Sales     Units
Product    Region
Airpods    East             90392   289     1614.142857  5.160714
           North            82284   254     1582.384615  4.884615
           South            89076   233     1746.588235  4.568627
           West             62061   178     1633.184211  4.684211
Headphones East             85423   275     1525.410714  4.910714
           North           107736   293     1608.000000  4.373134
           South            57484   196     1336.837209  4.558140
           West            106865   346     1526.642857  4.942857
Laptop     East             87038   276     1642.226415  5.207547
           North            57092   189     1463.897436  4.846154
           South            69748   223     1585.181818  5.068182
           West             93012   258     1691.127273  4.690909
Smartphone East             66136   240     1469.688889  5.333333
           North            86697   295     1376.142857  4.682540
           South            61887   221     1547.175000  5.525000
           West             80810   291     1524.716981  5.490566
Tablet     East             79285   279     1651.770833  5.812500
           North            68240   216     1706.000000  5.400000
           South            73944   259     1344.436364  4.709091
           West             48551   154     1517.218750  4.812500